# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of join statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [2]:
#Your code here
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
c = conn.cursor()

## Display the names of all the employees in Boston.
Hint: join the employees and customers tables.

In [3]:
#Your code here
c.execute('''SELECT lastName, firstName FROM employees JOIN customers WHERE city = 'Boston' ''').fetchall()

[('Murphy', 'Diane'),
 ('Murphy', 'Diane'),
 ('Patterson', 'Mary'),
 ('Patterson', 'Mary'),
 ('Firrelli', 'Jeff'),
 ('Firrelli', 'Jeff'),
 ('Patterson', 'William'),
 ('Patterson', 'William'),
 ('Bondur', 'Gerard'),
 ('Bondur', 'Gerard'),
 ('Bow', 'Anthony'),
 ('Bow', 'Anthony'),
 ('Jennings', 'Leslie'),
 ('Jennings', 'Leslie'),
 ('Thompson', 'Leslie'),
 ('Thompson', 'Leslie'),
 ('Firrelli', 'Julie'),
 ('Firrelli', 'Julie'),
 ('Patterson', 'Steve'),
 ('Patterson', 'Steve'),
 ('Tseng', 'Foon Yue'),
 ('Tseng', 'Foon Yue'),
 ('Vanauf', 'George'),
 ('Vanauf', 'George'),
 ('Bondur', 'Loui'),
 ('Bondur', 'Loui'),
 ('Hernandez', 'Gerard'),
 ('Hernandez', 'Gerard'),
 ('Castillo', 'Pamela'),
 ('Castillo', 'Pamela'),
 ('Bott', 'Larry'),
 ('Bott', 'Larry'),
 ('Jones', 'Barry'),
 ('Jones', 'Barry'),
 ('Fixter', 'Andy'),
 ('Fixter', 'Andy'),
 ('Marsh', 'Peter'),
 ('Marsh', 'Peter'),
 ('King', 'Tom'),
 ('King', 'Tom'),
 ('Nishi', 'Mami'),
 ('Nishi', 'Mami'),
 ('Kato', 'Yoshimi'),
 ('Kato', 'Yoshimi'),
 ('Gerard', 'Martin'),
 ('Gerard', 'Martin')]

## Do any offices have no employees?
Hint: Combine the employees and offices tables and use a group by.

In [4]:
#Your code here
c.execute('''SELECT city, count(*) FROM employees AS e JOIN offices AS o ON e.officeCode = o.officeCode GROUP BY city''').fetchall()

[('Boston', 2),
 ('London', 2),
 ('NYC', 2),
 ('Paris', 5),
 ('San Francisco', 6),
 ('Sydney', 4),
 ('Tokyo', 2)]

## Write 3 Questions of your own and answer them

# Answers will vary

In [5]:
# Your code here
# How many Toms work for the company?
c.execute('''SELECT COUNT(*) FROM employees WHERE firstName = 'Tom' ''').fetchall()

[(1,)]

In [6]:
# Your code here
# What are all of the cities that the company is in?
c.execute('''SELECT city FROM offices GROUP BY city''').fetchall()

[('Boston',),
 ('London',),
 ('NYC',),
 ('Paris',),
 ('San Francisco',),
 ('Sydney',),
 ('Tokyo',)]

In [7]:
# Your code here
# What domains are the e-mail addresses?
c.execute('''SELECT email FROM employees''').fetchall()

[('dmurphy@classicmodelcars.com',),
 ('mpatterso@classicmodelcars.com',),
 ('jfirrelli@classicmodelcars.com',),
 ('wpatterson@classicmodelcars.com',),
 ('gbondur@classicmodelcars.com',),
 ('abow@classicmodelcars.com',),
 ('ljennings@classicmodelcars.com',),
 ('lthompson@classicmodelcars.com',),
 ('jfirrelli@classicmodelcars.com',),
 ('spatterson@classicmodelcars.com',),
 ('ftseng@classicmodelcars.com',),
 ('gvanauf@classicmodelcars.com',),
 ('lbondur@classicmodelcars.com',),
 ('ghernande@classicmodelcars.com',),
 ('pcastillo@classicmodelcars.com',),
 ('lbott@classicmodelcars.com',),
 ('bjones@classicmodelcars.com',),
 ('afixter@classicmodelcars.com',),
 ('pmarsh@classicmodelcars.com',),
 ('tking@classicmodelcars.com',),
 ('mnishi@classicmodelcars.com',),
 ('ykato@classicmodelcars.com',),
 ('mgerard@classicmodelcars.com',)]

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Level Up: Display the names of each product each employee has sold

In [8]:
c.execute('''SELECT COUNT(*) FROM orderdetails''').fetchall()

[(2996,)]

In [9]:
# Your code here
c.execute('''SELECT firstName, lastName, productName 
                FROM orders o
                JOIN orderdetails od USING(orderNumber)
                JOIN products p USING(productCode)
                JOIN orderdetails od USING(orderNumber)
                JOIN customers c USING(customerNumber)
                JOIN employees e on c.salesRepEmployeeNumber = e.employeeNumber
                GROUP BY productName
                ORDER BY e.employeeNumber''')

df = pd.DataFrame(c.fetchall())
print(len(df))
df.head()

109

        0          1                                          2
0  Leslie   Jennings                     1928 Mercedes-Benz SSK
1  Leslie   Jennings  1938 Cadillac V-16 Presidential Limousine
2   Steve  Patterson                      18th century schooner
3   Steve  Patterson                          1903 Ford Model A
4   Steve  Patterson                        1904 Buick Runabout

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Level Up: Display the Number of Products each employee has sold

In [13]:
c.execute('''SELECT COUNT(*), firstName, lastName
             FROM orders o
             JOIN customers c USING(customerNumber)
             JOIN employees e ON c.salesRepEmployeeNumber = e.employeeNumber
             GROUP BY firstName, lastName''')
df = pd.DataFrame(c.fetchall())
df

     0         1          2
0   19      Andy     Fixter
1   25     Barry      Jones
2   17  Foon Yue      Tseng
3   22    George     Vanauf
4   43    Gerard  Hernandez
5   14     Julie   Firrelli
6   22     Larry       Bott
7   34    Leslie   Jennings
8   14    Leslie   Thompson
9   20      Loui     Bondur
10  16      Mami      Nishi
11  12    Martin     Gerard
12  31    Pamela   Castillo
13  19     Peter      Marsh
14  18     Steve  Patterson

## Summary

Congrats! You now know how to use join statements, along with leveraging your foreign keys knowledge!